/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   error.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By:  ctokoyod < ctokoyod@student.42tokyo.jp    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/02/22 17:45:12 by  ctokoyod         #+#    #+#             */
/*   Updated: 2024/02/25 19:14:12 by  ctokoyod        ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../includes/pipex.h"

void put_error_msg(const char *msg)
{
	perror(msg);
	// プログラムを途中で終了する
	exit(EXIT_FAILURE); // 1 異常終了
}